const r=new URL("/assets/hospital_old-BR-uQLTT.png",import.meta.url).href,s=`
  <p class="text-gray-700 leading-relaxed mb-4">
    โรงพยาบาลแม่แตง เดิมเป็นสถานีอนามัยชั้นหนึ่ง เปิดดำเนินการเมื่อ พ.ศ. 2502 ในสถานที่ซึ่ง
    เป็นสำนักงานสาธารณสุขอำเภอแม่แตงในปัจจุบัน <br>– พ.ศ. 2518
    ได้รับการยกฐานะขึ้นเป็นโรงพยาบาลขนาด 10 เตียง <br>– เดือนตุลาคม พ.ศ.2527
    ได้ย้ายไปก่อตั้งสถานที่แห่งใหม่ เพราะสถานที่เดิมคับแคบ <br>– เดือนกุมภาพันธ์ พ.ศ.2528 ได้
    สร้างสถานที่แห่งใหม่แล้วเสร็จ <br>– 12 มีนาคม พ.ศ.2528
    ได้เปิดให้บริการในสถานที่แห่งใหม่อย่างเป็นทางการ <br>– พ.ศ.2538
    ได้รับการยกฐานะขึ้นเป็นโรงพยาบาลขนาด 30 เตียง โดยเริ่มเปิดบริการในปี พ.ศ. 2539 ปี พ.ศ. 2542
    ได้รับอาคาร 30 เตียง 2 หลัง ปัจจุบันเปิดทำการ 57 เตียง มี 2 หอผู้ป่วย
  </p>
  <p class="text-gray-700 leading-relaxed mb-4">
    โรงพยาบาลแม่แตง ตั้งอยู่เลขที่ 300 หมู่ 7 ตำบลสันมหาพน อำเภอแม่แตง จังหวัดเชียงใหม่
    อยู่ทางทิศเหนือของจังหวัดเชียงใหม่ ตามทางหลวงแผ่นดินหมายเลข 107 เส้นทางสายเชียงใหม่ – ฝาง
    กิโลเมตรที่ 40 ระยะห่างจากกรุงเทพฯ 735 กิโลเมตร มีเนื้อที่ประมาณ 1,362 ตารางกิโลเมตร
    ปัจจุบันเป็นโรงพยาบาลขนาด 60 เตียง
    ให้บริการครอบคลุมพื้นที่เขตอำเภอแม่แตงและอำเภอใกล้เคียงที่สะดวกในการมารับบริการ
  </p>
`,o={id:1,title:"ประวัติโรงพยาบาล",contentHtml:s,imageUrl:r};async function a(){return new Promise(t=>{setTimeout(()=>{t(o)},300)})}async function n(t){return console.log("Mock Update History:",t),new Promise(e=>{setTimeout(e,500)})}export{a as f,n as u};
